app/controllers/rainbows_controller.rb

  def index
    @rainbows = Rainbow.all
---
SELECT "rainbows".* FROM "rainbows"